Revit 2024 API
ContinuousRail.GetPath Method
 Retrieves the rail path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<Curve> GetPath()
Visual Basic
Public Function GetPath As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetPath()
Return Value
 The path of the rail.
See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace